load-testing/server.yaml
config:
  target: https://0v6jgfpbw6.execute-api.ap-southeast-1.amazonaws.com/prod
  phases:
    - duration: 600
      arrivalRate: 50
  defaults:
    headers:
      x-api-key: JX80PwmqmD6pa6ZBea4d93XYePoPxcsr6MWHlctb            

scenarios:
  - flow:
    - post:
        url: /
        json:
          {
            "merchantOrderID": 321,
            "customerID": 123,
            "customerAddress": "destination address",
            "sellerID": 123,
            "sellerAddress": "pickup address"
          }